In [ ]:
!pip install pandas

In [ ]:
#라이브러리 로드
import pandas as pd

In [ ]:
#스리즈 형태 데이터 생성
pd_list = pd.Series([5000, 6000, 6500, 6500], index = ['아메리카노', '카페라떼', '카페모카', '카푸치노'])

In [ ]:
print(pd_list)

In [ ]:
print('스리즈 형태의 데이터에서 index의 값은 : ', pd_list.index)
print('스리즈 형태의 데이터에서 value의 값은 : ', pd_list.values)

In [ ]:
# 2차원 데이터셋
# 데이터프레임 생성
_value = [[1,2,3], [4,5,6],[7,8,9]]
_index = ['a', 'b', 'c']
_column = ['A','B','C']

df = pd.DataFrame(_value, index = _index, columns = _column)
df

In [ ]:
print('데이터프레임의 인덱스 값', df.index)
print('데이터프레임의 컬럼의 값', df.columns)
print('데이터 프레임에서 밸류의 값', df.values)

In [ ]:
# 딕셔너리 형태의 데이터를 가지고 dataframe 생성
_value = {"name" : ['test', 'test2', 'test3'], "age" : [20, 30, 25], "phone" : ['01012345678', '01023425232', '010252556666']}
print(_value)

In [ ]:
df2 = pd.DataFrame(_value)
df2

In [ ]:
df2['name'] #숫자형일때 무조건 대괄호를 써야함

In [ ]:
df2.name

### 경로
1. 절대 경로   
    - 환경이 변하더라도 같은 위치를 지정
    - ex) c:/users/user/document/a.txt, 인터넷 url

2. 상대 경로
    - 상대적인 경로
    - 환경에 따라 위치가 달라진다.
    - ./ : 현재 파일의 경로
    - ../ : 현재 경로에서 상위 폴더로 이동
    - 폴더명/ : 해당하는 하위 폴더로 이동

In [ ]:
#코로나 데이터를 로드
# 현재 파일의 경로에서 상위 폴더로 이동 csv 하위 폴더 이동 corona.csv
# 상대 경로로 파일의 위치를 지정
pd.read_csv("../욱/230331/230403/230404/csv/corona.csv")

In [ ]:
# 절대 경로로 파일의 위치를 지정
df = pd.read_csv("C:\\Users\\user\\Desktop\\욱\\230331\\230403\\230404\\csv\\corona.csv")

In [44]:
# chipotle.tsv 파일을 로드
# 현재 경로에서 상위 폴더로 이동 / csv 하위 폴더로 이동 / num_1 하위 폴더로 이동/ 이 곳에 있는 파일 로드

pd.read_csv("../욱/230331/230403/230404/csv/num_1/chipotle.tsv", sep = "\t")

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
...,...,...,...,...,...
4617,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Sour ...",$11.75
4618,1833,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Sour Cream, Cheese...",$11.75
4619,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$11.25
4620,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Lettu...",$8.75
4621,1834,1,Chicken Salad Bowl,"[Fresh Tomato Salsa, [Fajita Vegetables, Pinto...",$8.75

In [ ]:
# json 파일 로드
# read_json()
#csv 폴더 안에 있는 2019 폴더에 있는 파일 하나 오픈

pd.read_json('../욱/230331/230403/230404/csv/2019/201901_expense_list.json')

In [ ]:
# xlsx 파일 로드
# read_excel()
#csv 폴더 안에 있는 2017 파일 하나 오픈
pd.read_excel('../욱/230331/230403/230404/csv/2020/202001_expense_list.xlsx')

In [45]:
!pip install openpyxl

Requirement already satisfied: openpyxl in c:\users\user\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (3.1.2)
Requirement already satisfied: et-xmlfile in c:\users\user\appdata\local\packages\pythonsoftwarefoundation.python.3.10_qbz5n2kfra8p0\localcache\local-packages\python310\site-packages (from openpyxl) (1.1.0)

[notice] A new release of pip available: 22.3.1 -> 23.0.1
[notice] To update, run: C:\Users\user\AppData\Local\Microsoft\WindowsApps\PythonSoftwareFoundation.Python.3.10_qbz5n2kfra8p0\python.exe -m pip install --upgrade pip

In [47]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 820 entries, 0 to 819
Data columns (total 10 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  820 non-null    int64
 1   createDt    820 non-null    object
 2   deathCnt    820 non-null    int64
 3   decideCnt   820 non-null    int64
 4   seq         820 non-null    int64
 5   stateDt     820 non-null    int64
 6   stateTime   820 non-null    object
 7   updateDt    817 non-null    object
 8   accExamCnt  692 non-null    float64
 9   accDefRate  623 non-null    float64
dtypes: float64(2), int64(5), object(3)
memory usage: 64.2+ KB

### 결측치

In [50]:
import pandas as pd
import numpy as np

In [53]:
_value = [
    [1,2,3],
    [4,np.nan,6],
    [7,8,np.nan]]

df = pd.DataFrame(_value)
df

   0    1    2
0  1  2.0  3.0
1  4  NaN  6.0
2  7  8.0  NaN

In [55]:
# 결측치를 확인
# 데이터 프레임의 정보를 확인
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   0       3 non-null      int64
 1   1       2 non-null      float64
 2   2       2 non-null      float64
dtypes: float64(2), int64(1)
memory usage: 200.0 bytes

In [58]:
# is()함수를 사용하여 결측치를 확인
# isna() 함수 사용

df.isna().sum()

0    0
1    1
2    1
dtype: int64

In [63]:
# 결측치 제거
# 데이터 유실 주의 
# dropna() 는 결측치를 제거하는 함수
# 매개변수 axis : 0, 'rows' 을 대입하면 해당하는 행을 삭제
#                 1, 'column'을 대입하면 해당하는 열을 삭제

df.dropna(axis = 1)

   0
0  1
1  4
2  7

In [69]:
#sales 데이터 로드

sales = pd.read_csv("../욱/230331/230403/230404/csv/Sales Records.csv")
sales.head(2)

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
0,Sub-Saharan Africa,Chad,Office Supplies,Online,L,1/27/2011,292494523,2/12/2011,4484,651.21,524.96,2920025.64,2353920.64,566105.0
1,Europe,Latvia,Beverages,Online,C,12/28/2015,361825549,1/23/2016,1075,47.45,31.79,51008.75,34174.25,16834.5

In [76]:

flg = sales['Region'] == 'Asia'

In [84]:
# 데이터 프레임 필터 기능

# loc[행의 조건, 열의 조건]

#행의 조건을 가지고 필터링
sales.loc[flg] # ~flg 입력 시 반대로 실행

#열의 조건을 가지고 필터링
sales.loc[:, ['Order Priority', 'Order Date']]

#행과 열의 조건을 모두 적용시켜서 필터
sales.loc[flg, ['Region']]

# iloc[행의 위치, 열의 위치]
sales.iloc[1:3]

,Region,Country,Item Type,Sales Channel,Order Priority,Order Date,Order ID,Ship Date,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
1,Europe,Latvia,Beverages,Online,C,12/28/2015,361825549,1/23/2016,1075,47.45,31.79,51008.75,34174.25,16834.50
2,Middle East and North Africa,Pakistan,Vegetables,Offline,C,1/13/2011,141515767,2/1/2011,6515,154.06,90.93,1003700.90,592408.95,411291.95

In [82]:
sales['Region']

0                 Sub-Saharan Africa
1                             Europe
2       Middle East and North Africa
3                 Sub-Saharan Africa
4                             Europe
                    ...
9995                            Asia
9996                          Europe
9997              Sub-Saharan Africa
9998              Sub-Saharan Africa
9999                            Asia
Name: Region, Length: 10000, dtype: object

In [90]:

# 결측치가 포함된 데이터만 필터

flgna = df.isna().any(axis = 1)

In [93]:
df.loc[~flgna]

   0    1    2
0  1  2.0  3.0

In [96]:
sales.isna().sum()

Region            0
Country           0
Item Type         0
Sales Channel     0
Order Priority    0
Order Date        0
Order ID          0
Ship Date         0
Units Sold        0
Unit Price        0
Unit Cost         0
Total Revenue     0
Total Cost        0
Total Profit      0
dtype: int64

In [101]:
uriage = pd.read_csv('../욱/230331/230403/230404/csv/uriage.csv')

In [102]:
#결측치 확인
uriage.isna().sum()

purchase_date      0
item_name          0
item_price       387
customer_name      0
dtype: int64

In [104]:
uriage.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 2999 entries, 0 to 2998
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   purchase_date  2999 non-null   object
 1   item_name      2999 non-null   object
 2   item_price     2612 non-null   float64
 3   customer_name  2999 non-null   object
dtypes: float64(1), object(3)
memory usage: 93.8+ KB

In [109]:
# 결측치가 존재하는 조건 생성

uriage.isna().any(axis=1)

0       False
1        True
2        True
3       False
4        True
        ...
2994    False
2995    False
2996     True
2997     True
2998    False
Length: 2999, dtype: bool

In [113]:
uriage.loc[~(uriage.isna().any(axis=1))]

         purchase_date item_name  item_price customer_name
0     2019-06-13 18:02       상품A       100.0           김가온
3     2019-02-12 23:40       상품Z      2600.0           김재현
5     2019-03-20 19:16       상품S      1900.0           김우진
7      2019-04-18 0:14       상품V      2200.0           김민혁
8     2019-01-10 15:51       상품O      1500.0           김선우
...                ...       ...         ...           ...
2991  2019-02-18 14:36       상품W      2300.0           김우빈
2993   2019-01-25 3:57       상품C       300.0           김이안
2994   2019-02-15 2:56       상품Y      2500.0           김정민
2995   2019-06-22 4:03       상품M      1300.0           김재원
2998   2019-07-21 0:31       상품D       400.0           정준기

[2612 rows x 4 columns]

In [117]:
uriage.dropna(axis=0)

         purchase_date item_name  item_price customer_name
0     2019-06-13 18:02       상품A       100.0           김가온
3     2019-02-12 23:40       상품Z      2600.0           김재현
5     2019-03-20 19:16       상품S      1900.0           김우진
7      2019-04-18 0:14       상품V      2200.0           김민혁
8     2019-01-10 15:51       상품O      1500.0           김선우
...                ...       ...         ...           ...
2991  2019-02-18 14:36       상품W      2300.0           김우빈
2993   2019-01-25 3:57       상품C       300.0           김이안
2994   2019-02-15 2:56       상품Y      2500.0           김정민
2995   2019-06-22 4:03       상품M      1300.0           김재원
2998   2019-07-21 0:31       상품D       400.0           정준기

[2612 rows x 4 columns]

In [118]:
# 통계 요약 정보 출력하는 함수

sales.describe()

,Order ID,Units Sold,Unit Price,Unit Cost,Total Revenue,Total Cost,Total Profit
count,1.000000e+04,10000.000000,10000.000000,10000.000000,1.000000e+04,1.000000e+04,1.000000e+04
mean,5.498719e+08,5002.855900,268.143139,188.806639,1.333355e+06,9.382658e+05,3.950893e+05
std,2.607835e+08,2873.246454,217.944092,176.445907,1.465026e+06,1.145914e+06,3.775550e+05
min,1.000892e+08,2.000000,9.330000,6.920000,1.679400e+02,1.245600e+02,4.338000e+01
25%,3.218067e+08,2530.750000,109.280000,56.670000,2.885511e+05,1.647855e+05,9.832914e+04
50%,5.485663e+08,4962.000000,205.700000,117.110000,8.000512e+05,4.816058e+05,2.890990e+05
75%,7.759981e+08,7472.000000,437.200000,364.690000,1.819143e+06,1.183822e+06,5.664227e+05
max,9.999342e+08,10000.000000,668.270000,524.960000,6.680027e+06,5.241726e+06,1.738178e+06